Tutorials-2.4.0/cdv/transient/0/constrain.include

    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
